In [20]:
#Q1. Create a Pandas Series that contains the following data: 4, 8, 15, 16, 23, and 42. Then, print the series.

In [29]:
import pandas as pd

In [30]:
pip install pandas

Requirement already satisfied: pandas in /opt/conda/lib/python3.10/site-packages (1.5.2)
Requirement already satisfied: python-dateutil>=2.8.1 in /opt/conda/lib/python3.10/site-packages (from pandas) (2.8.2)
Requirement already satisfied: pytz>=2020.1 in /opt/conda/lib/python3.10/site-packages (from pandas) (2022.6)
Requirement already satisfied: numpy>=1.21.0 in /opt/conda/lib/python3.10/site-packages (from pandas) (1.23.5)
Requirement already satisfied: six>=1.5 in /opt/conda/lib/python3.10/site-packages (from python-dateutil>=2.8.1->pandas) (1.16.0)
Note: you may need to restart the kernel to use updated packages.

In [31]:




list=[4,8,15,16,23,42]
x=pd.Series(list)
x

0     4
1     8
2    15
3    16
4    23
5    42
dtype: int64

In [32]:
#Q2. Create a variable of list type containing 10 elements in it, and apply pandas.Series function on the
#variable print it.

In [33]:

s=['a','s','w','g','e','n','g','i','n','e','e','r']
g=pd.Series(s)
g

0     a
1     s
2     w
3     g
4     e
5     n
6     g
7     i
8     n
9     e
10    e
11    r
dtype: object

In [36]:
#Q3. Create a Pandas DataFrame that contains the following data:
#Then, print the DataFrame.
data=[["alice",25,"male"],["bob",30,"female"],["claire",27,"male"]]
df=pd.DataFrame(data,columns=["name","age","gender"])
df

     name  age  gender
0   alice   25    male
1     bob   30  female
2  claire   27    male

In [ ]:
"""Q4. What is ‘DataFrame’ in pandas and how is it different from pandas.series? Explain with an example."""
# ans DataFrame is the containg moree than one columns on the other hand series containing only one column eg of both are shown above

In [37]:
"""Q5. What are some common functions you can use to manipulate data in a Pandas DataFrame? Can
you give an example of when you might use one of these functions?"""
#head()-to access starting elements of the data
#tail()-to access the ending elements of the data
#shape-counting number of rows and columns
data=[["alice",25,"male"],["bob",30,"female"],["claire",27,"male"]]
df=pd.DataFrame(data,columns=["name","age","gender"])
df

     name  age  gender
0   alice   25    male
1     bob   30  female
2  claire   27    male

In [38]:
df.head(2)

    name  age  gender
0  alice   25    male
1    bob   30  female

In [40]:
df.tail(1)

     name  age gender
2  claire   27   male

In [42]:
df.shape

(3, 3)

In [44]:
#Q6. Which of the following is mutable in nature Series, DataFrame, Panel?"""
"""ans-data frame and panel  is mutable """

'ans-data frame and panel  is mutable '

In [12]:
#Q7. Create a DataFrame using multiple Series. Explain with an example.
import pandas as pd
stu= (2,3,4,5,6)
marks =(23,45,65,44,33)
a=pd.Series(stu)
b=pd.Series(marks)
pd.DataFrame(b,a)

      0
2  65.0
3  44.0
4  33.0
5   NaN
6   NaN